; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(in-air ?x)
		(sth-in-air)
	)
		; podnieœ klocek z pod³ogi
	(:action podnies-z-podlogi
		:parameters (?x)
		:precondition
		(and
			(clear ?x)
			(on-floor ?x)
			(not (sth-in-air))
		)
		:effect
		(and
			(in-air ?x)
			(sth-in-air)
			(not (on-floor ?x))
			(not (clear ?x))
		)
	)
		; podnies klocek z klocka
	(:action podnies-z-klocka
		:parameters (?x ?y)
		:precondition
		(and
			(on-top ?x ?y)
			(clear ?x)
			(not (sth-in-air))
		)
		:effect
		(and
			(in-air ?x)
			(clear ?y)
			(sth-in-air)
			(not (on-top ?x ?y))
			(not (clear ?x))
		)
	)
		; poloz klocek na podlodze
	(:action opusc-na-podloge
		:parameters (?x)
		:precondition
			(in-air ?x)
		:effect
		(and
			(not (sth-in-air))
			(not (in-air ?x))
			(on-floor ?x)
			(clear ?x)
		)
	)
		; poloz klocek na klocku
	(:action opusc-na-klocek
		:parameters (?y ?x)
		:precondition
		(and
			(in-air ?x)
			(clear ?y)
		)
		:effect
		(and
			(on-top ?x ?y)
			(not (clear ?y))
			(not (in-air ?x))
			(not (sth-in-air))
			(clear ?x)
		)
	)		
)

; problem
(define (problem p1)
	(:domain world-of-blocks)
	(:objects a b c d e f g h)
	(:init
		(clear a) 
		(clear b) 
		(clear c) 
		(clear d) 
		(clear e) 
		(clear f) 
		(clear g) 
		(clear h)
		(on-floor a)
		(on-floor b)
		(on-floor c)
		(on-floor d)
		(on-floor e)
		(on-floor f)
		(on-floor g)
		(on-floor h)
	)
	(:goal
		(and
			; zadanie 1
			(on-top d b)
			(or (on-top b c) (on-top b a) (on-top b e))
			
			; zadanie 2
			;(on-floor a)
			;(on-floor b)
			;(on-floor c)
			;(on-floor d)
			;(on-floor e)
			
			; zadanie 3
			;(or (on-floor a) (on-floor b) (on-floor c) (on-floor d) (on-floor e) (on-floor f) (on-floor g) (on-floor h))
			;(or (clear a) (clear b) (clear c) (clear d) (clear e) (clear f) (clear g) (clear h))
		)
	)
)

; plan
1. (podnies-z-podlogi b)
   deleted: (on-floor b) (clear b)
   added: (in-air b) (sth-in-air)
   goals met: 0 of 2
2. (opusc-na-klocek a b)
   deleted: (clear a) (in-air b) (sth-in-air)
   added: (on-top b a) (clear b)
   goals met: 1 of 2
3. (podnies-z-podlogi d)
   deleted: (on-floor d) (clear d)
   added: (in-air d) (sth-in-air)
   goals met: 1 of 2
4. (opusc-na-klocek b d)
   deleted: (clear b) (in-air d) (sth-in-air)
   added: (on-top d b) (clear d)
   goals met: 2 of 2
